<?php

// Heading
$_['heading_title'] = 'Zibal Online Payment';

// Text
$_['text_basket'] = 'Shopping Cart';
$_['text_checkout'] = 'Checkout';
$_['text_transaction'] = 'Transaction No: ';
$_['text_transaction_reference'] = 'شماره مرجع: ';
$_['text_title'] 		 = 'Zibal Online Payment';
$_['text_wait']  		 = 'لطفا صبر نمایید!';
$_['text_connect'] 		 = 'در حال اتصال به درگاه زیبال!';
$_['text_results']  	 = 'رسید زیبال : ';
$_['text_order_no']  	 = 'خرید شماره: ';

// Error
$_['error_head'] = 'Error! ';
$_['error_code'] = 'Error Code: ';
$_['error_message'] = 'Error Message: ';
$_['error_request'] = 'در ارتباط با درگاه پرداخت زیبال خطایی رخ داده است.';
$_['error_verify'] = 'در ارتباط با درگاه پرداخت زیبال و یا تایید تراکنش خطایی رخ داده است.';
$_['error_payment'] = 'تراكنش ناموفق می باشد و یا توسط پرداخت کننده کنسل شده است.';
$_['error_data'] = 'اطلاعات ارسال شده مربوط به تایید تراکنش ناقص و یا غیر معتبر است.';
$_['error_invoice'] = 'شماره سفارش با شماره فاکتور پرداخت شده مطابقت ندارد.';
$_['error_amount'] = 'رقم تراکنش با رقم پرداخت شده مطابقت ندارد.';
$_['error_curl'] = 'تابع cURL برای اتصال به درگاه پرداخت زیبال در سرور شما فعال نمی باشد. برای فعال کردن این تابع با مدیر سرور خود تماس بگیرید.';
$_['error_undefined'] = 'امکان برقراری ارتباط به وب سرویس درگاه پرداخت زیبال در این لحظه وجود ندارد و یا پاسخ دریافتی غیر معتبر است.';
$_['error_order_id']	 = 'شماره سفارش پیدا نشد !';
$_['error_order_id']	 = 'شماره سفارش پیدا نشد !';
$_['error_verify'] 		 	= 'اعتبارسنجی تراکنش ناموفق بود';
$_['error_cant_connect']	= 'مشکلی در اتصال به درگاه زیبال پیش آمده است!<br>'.
								'لطفا مجددا امتحان کنید.<br>'.
								'در صورت رفع نشدن مشکل به پشتیبانی زیبال اطلاع دهید.';
$_['error_connect_verify'] 	= 'مشکلی در اعتبارسنجی پرداخت پیش آمد!<br>'.
								'لطفا مجددا امتحان کنید.<br>'.
								'در صورت رفع نشدن مشکل به پشتیبانی زیبال اطلاع دهید.';
// $_['error_status_-1'] 		= "اطلاعات ارسالی ناقص می باشند";
$_['error_status_undefined']= "خطای نامشخص";

// Button
$_['button_view_cart']	 = 'مشاهده سبد خرید';
$_['button_complete']    = 'تکمیل پرداخت';
?>